// збереження ід
let newsList = document.getElementById('news-list');
let newsDetails = document.getElementById('news-details');

const sushiBarNews = [
    { title: 'Відкриття нового суші бару', content: 'У нашому місті відкрили новий суші бар "Японський смак". Відвідайте наш заклад та насолоджуйтесь справжнім японським смаком!', date: '2024-03-01' },
    { title: 'Спеціальна пропозиція для гостей', content: 'Тільки сьогодні і завтра! Замовляйте будь-який рол "Спайсі Ролл" та отримайте знижку 50%! Не пропустіть свій шанс!', date: '2024-03-05' },
    { title: 'Майстер-клас з приготування суші', content: 'У вівторок, 10 березня, о 18:00 відбудеться майстер-клас з приготування суші в нашому закладі. Реєстрація обов\'язкова.', date: '2024-03-08' },
    { title: 'Нові страви в меню', content: 'Ми раді представити вам наші нові страви: "Філадельфія з лососем" та "Темпура мідія". Приходьте та смакуйте!', date: '2024-03-12' },
    { title: 'Дегустація новинок', content: 'У п`ятницю, 15 березня, о 19:00 відбудеться дегустація наших нових страв для наших постійних клієнтів. Реєстрація обов`язкова.', date: '2024-03-14' },
    { title: 'Акція "Купи одне - отримай друге"', content: 'Тільки в ці вихідні! При замовленні будь-якого суші сету другий отримуйте у подарунок! Поспішайте!', date: '2024-03-18' },
    { title: 'Оновлене меню десертів', content: 'З задоволенням представляємо вам оновлене меню десертів! Нові смаки та комбінації, які зачарують ваші смакові рецептори!', date: '2024-03-22' },
    { title: 'Спеціальні пропозиції на вихідні', content: 'На цих вихідних у нас для вас діють спеціальні пропозиції! Знижки на роли та напої, а також подарунки для кожного гостя!', date: '2024-03-25' },
    { title: 'Нове місце для ваших заходів', content: 'Плануєте вечірку або корпоратив? Зробіть свій захід незабутнім, замовивши його у нас! Затишна атмосфера та смачна їжа гарантовані!', date: '2024-03-28' },
    { title: 'Відгуки наших клієнтів', content: 'Дякуємо всім нашим клієнтам за їхні відгуки! Ми завжди раді бачити вас у наших закладах та радуємося з вас кожного дня!', date: '2024-03-31' }
];

// Вивід
function showNewsDetails(title, content) {
    newsDetails.innerHTML = `<h2>${title}</h2><p>${content}</p>`;
}

sushiBarNews.sort((a, b) => new Date(b.date) - new Date(a.date)).forEach(news => {
    const listItem = document.createElement('li');
    listItem.textContent = news.title;
    listItem.classList.add('news-item');
    listItem.addEventListener('click', () => {
        showNewsDetails(news.title, news.content);
    });
    newsList.appendChild(listItem);
});

// Автоматичне розгортання першої новини на мобільних пристроях
if (window.innerWidth <= 768) {
    const firstNewsItem = newsList.querySelector('.news-item');
    if (firstNewsItem) {
        firstNewsItem.click();
    }
}


